import collections

# Вихідний текст
text = "За вікном починається весна. Перші промені сонця лагідно торкаються землі, \
пробуджуючи природу. Краплини роси блищать на молодій траві, немов діаманти. Птахи повертаються з теплих країв, \
наповнюючи повітря своїм співом. Все навколо оживає, і серце переповнюється радістю та надією на нове життя. \
Весна — це час змін, нових починань та безмежних можливостей."

# Створюємо три копії тексту
texts = [text, text, text]

# 1. Вивести найчастіше зустрічаємі символи в тексті
counter = collections.Counter(texts[0])
most_common_chars = counter.most_common(5)
print("Найчастіше зустрічаємі символи:")
for char, count in most_common_chars:
    print(f"Символ '{char}' зустрічається {count} разів")

# 2. Вивести текст без пробілів
text_without_spaces = texts[1].replace(" ", "")
print("\nТекст без пробілів:\n")
print(text_without_spaces)

# 3. Представити всі символи в виді юнікоду
print("\nТекст у вигляді юнікоду:\n")
unicode_text = [ord(char) for char in texts[2]]
print(unicode_text)
